## Introduction
#### 데이터 분석의 첫 관문운 데이터에 접근하는것이다. 일반적으로 입출력은  몇가지 범주로 나뉘는데, 텍스트 파일을 이용하는 방법, 
#### 데이터베이스를 이용하는 방법, 웹 API를 이용해서 네트워크를 통해 불러오는 방법이 있다.

## 텍스트 파일에서 데이터를 일고 쓰는 법 
#### pandas에는 표 형식의 자료를 DataFrame 객체로 읽어오는 몇가지 방법을 제공한다. 주로 사용하는 방법이 read_csv와 read_table이다.
#### 표 6-1 참조 
#### 표 6-1의 함수들은 데이터를 DataFrame으로 읽어오기 위한 함수인데, 몇가지 옵션을 취한다. 
#### 1. 색인(Indexing): 반환하는 DataFRame에서 하나 이상의 칼럼을 색인으로 지정할 수 있다. 파일이나 사용자로부터 컬럼이름을 받거나 아무것도 받지 않을수 있다. 
#### 2. 자료형 추론과 데이터 변환(Type Inference and Data Conversion): 사용자 정의값 변환과 비어있는 값을 위한 사용자 리스트를 포함
#### 3. 날짜분석(Datetime Parsing): 여러 컬럼에 걸쳐있는 날짜와 시간정보를 하나의 컬럼에 조합해서 결과에 반영한다. 
#### 4. 반복(Iterating): 여러개의 파일에 걸쳐있는 자료를 반복적으로 읽어올 수있다. 
#### 5. 정제되지 않은 데이터 처리(Unclean Data Issues): row나 꼬리말, 주석 건너뛰기 또는 천 단위마다 쉼표로 구분되는 숫자같은 사소한 것들을 처리해 준다.

In [17]:
#쉼표로 구분된 작은 규모의 csv 파일 예, type은 윈도우 사용자
!type examples\ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [18]:
#쉼표로 구분된 작은 규모의 csv 파일 예
!cat examples\ex1.csv #cat은 유닉스 사용자

'cat'은(는) 내부 또는 외부 명령, 실행할 수 있는 프로그램, 또는
배치 파일이 아닙니다.

#### CSV(영어: comma-separated values)는 몇 가지 필드를 쉼표(,)로 구분한 텍스트 데이터 및 텍스트 파일이다. 
#### 비슷한 포맷으로는 탭으로 구분하는 'tab-separated values'(TSV)나, 반각 스페이스로 구분하는 'space-separated values'(SSV) 등이 있으며, 이것들을 합쳐서 character-separated values (CSV), delimiter-separated values라고 부르는 경우가 많다.

In [5]:
import pandas as pd

df = pd.read_csv('examples/ex1.csv') #이 파일은 쉼표로 구분되어 있기때문에 read_csv를 사용해서 DataFrame으로 읽어 온다.
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [20]:
pd.read_table('examples/ex1.csv',sep=',') # read_table에 구분자를 쉽표로 지정해서 읽어올 수도 있다.

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

#### pandas 파일 파싱함수
#### read_csv : 데이터 구분자는 쉼표(,)를 기본으로 한다.
#### read_table : 데이터 구분자는 탭(\t)을 기본으로 한다.

#### 모든 파일에 컬럼 이름이 있는 것은 아니다.

In [5]:
!type examples\ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [7]:
pd.read_csv('examples/ex2.csv', header=None) #pandas가 자동으로 컬럼이름을 생성

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [8]:
pd.read_csv('examples/ex2.csv', names=['a','b','c','d','message']) #직접 컬럼 이름을 지정

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [10]:
#message 컬럼을 색인으로 하는 DataFrame을 반환 하는 예
#index_col 인자에 4번째 컬럼 또는 'message'이름을 가진 컬럼을 지정해서 색인으로 만들수 있다.
names = ['a','b','c','d','message']
pd.read_csv('examples/ex2.csv', names=names, index_col= 'message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [11]:
#계층적 색인을
!type examples\csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [12]:
parsed = pd.read_csv('examples/csv_mindex.csv')
parsed

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [13]:
# 계층적 색인을 지정하고 싶으면 컬럼 번호나 이름의 리스트를 넘긴다.
parsed = pd.read_csv('examples/csv_mindex.csv', index_col=['key1', 'key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

#### 가끔 고정된 구분자 없이 공백이나 다른 패턴으로 필드를 구분해 놓은 경우가 있다.

In [14]:
list(open('examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [16]:
#이 파일은 여러개의 공백 문자로 구분되므로, 이를 표현하할 수 있는 정규 표현식 \s+를 사용해서 처리 
#첫번째 row가 다른 row보다 컬럼하나가 적기때문에 read_table은 첫 번쩨 컬럼이DataGrame의 색인이 되어야 한다고 추론하다.
# \s+ : 공백 문자와 매치 [\t\n\r\f\v], + : 1개 이상의 문자를 포함

# , 로 구분된 데이터 파일의 경우: sep=','
# | 로 구분된 데이터 파일의 경우: sep='\|'
# 공백 문자와 콤마로 구분된 데이터 파일의 경우: sep='\s*,\s*'
# 탭 문자로 구분된 데이터 파일의 경우: sep='\t'
result = pd.read_table('examples/ex3.txt', sep='\s+') 
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

#### 파서함수는 다양한 예외처리를 할 수 있도록 많은 추가 인자를 가지고 있다. (표 6-2 참조)
#### 예를들어 skiprow를 이용해서 첫번째, 세번째, 네번째 row를 건너뛸수 있다.

In [21]:
!type examples\ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [24]:
pd.read_csv('examples/ex4.csv', skiprows=[0,2,3])
# hey!
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
# 위의 3개를 없앰

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [25]:
pd.read_csv('examples/ex4.csv', index_col='message', skiprows=[0,2,3])

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

#### 누락된 값을 처리하는 것은 중요한 문제이다. 보통 텍스트 파일에서 누락된 값은 표기되지 않거나(비어있는 문자열) 구분하기 쉬운 특수한 문자로 표기된다. 기본적으로 pandas는 NA나 NULL처럼 흔히 통용되는 문자를 비어있는 값으로 사용한다.

In [26]:
!type examples\ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [27]:
result = pd.read_csv('examples/ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [29]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [35]:
#na_values 옵션은 리스트나 문자열 집합을 받아서 누락된 값을 처리한다.
result = pd.read_csv('examples/ex5.csv', na_values=['NULL']) # 만약 world를 넣을 경우 world문자열은 NaN이 된다
result

# 예를 들어, 데이터 파일 내에서 "NULL" 이라는 문자열이 결측값을 나타내는 경우, na_values=['NULL'] 매개변수를 pd.read_csv() 함수에 전달하여
# "NULL" 문자열을 결측값으로 인식하도록 할 수 있습니다. 따라서 pd.read_csv() 함수는 "NULL" 문자열을 NaN(Not a Number) 값으로 처리하게 
# 됩니다.

# na_values 매개변수에는 리스트(list)나 딕셔너리(dictionary) 형태로 여러 개의 결측값을 지정할 수 있습니다. 
# 리스트 형태로 지정할 경우, 리스트에 포함된 모든 값들이 결측값으로 인식됩니다. 딕셔너리 형태로 지정할 경우,
# 키(key)에 해당하는 문자열이 파일 내에서 발견되면 값(value)으로 지정된 값을 결측값으로 인식합니다. 
# 예를 들어, na_values={'NULL': 0, '-999': 0}과 같이 딕셔너리 형태로 na_values를 지정하면 "NULL"과 "-999" 문자열을 0으로 인식하게 됩니다.

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [36]:
!type examples\ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [38]:
#컬럼마다 다른 NA문자를 사전값으로 넘겨서 처리할 수도 있다.
sentinels = {'message': ['foo','NA'], 'something':['two']} #message 컬럼에서 'foo'와 'NA'를, something 컬럼에서 'two'를 NaN으로 처리

pd.read_csv('examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

## 실습 
### 아래의 pd.read_csv 함수에 사용된 각 인자들의 의미를 찾아보시오

data = pd.read_csv('test.csv', header=1, usecols='A:G', skipfooter=4)

### 텍스트 파일을 조금씩 읽어오기 
#### 매우 큰 파일을 처리할 때, 인자를 제대로 주었는지 알아보기 위해 파일의 일부만을 일어보거나, 여러개의 파일중 몇개만 읽어서 확인하고자 할때 사용한다.

In [39]:
pd.options.display.max_rows = 10

result = pd.read_csv('examples/ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [40]:
pd.read_csv('examples/ex6.csv',nrows=10) #nrow 옵션을 사용해서 읽어오는 양을 지정

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q
5  1.817480  0.742273  0.419395 -2.251035   Q
6 -0.776764  0.935518 -0.332872 -1.875641   U
7 -0.913135  1.530624 -0.572657  0.477252   K
8  0.358480 -0.497572 -0.367016  0.507702   S
9 -1.740877 -1.160417 -1.637830  2.172201   G

In [41]:
#파일을 여러조각으로 나누어 읽고 싶다면, chunksize 옵션으로 row의 갯수를 지정
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)
chunker

In [42]:
#ex6.csv파일을 chunker사이즈로 읽어 순회하며 'key'row에 있는 값을 세어보는 예
tot = pd.Series([])
    
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0) # fill_value=0 이것은 결측값이 있을 경우 0으로 처리하고 계산하라는 뜻

tot = tot.sort_values(ascending=False)
tot[:10]

C:\Users\PARKSEUNGHEUN\AppData\Local\Temp\ipykernel_14904\1155843134.py:2: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  tot = pd.Series([])

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

## 실습
### 위 예제에서 add함수의 인자 중,  fill_value=0의 의미는?

### 데이터를 텍스트 형식으로 기록하기

In [45]:
data = pd.read_csv('examples/ex5.csv')

data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [46]:
data.to_csv('examples/out.csv')  #to_csv 메소드를 사용하면 데이터를 쉽표로 구분된 형식으로 파일에 쓸 수 았다.

In [47]:
!type examples\out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [48]:
#다른 구분자도 가능 : 쉼표 대신 |를 구분자로 사용한 예
import sys

data.to_csv(sys.stdout, sep='|') #콘솔에서 확인할 수 있도록 실제 파일에 기록하지 않고 stdout에 결과를 기록

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [51]:
data.to_csv(sys.stdout, na_rep='NULL') #누락된 값은 비어있는 문자열로 나타나는데, 이것 역시 원하는 값으로 지정가능하다. 
# 1을 넣을 경우 누락값이 1이된다~

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [52]:
#row와 col 이름 없이 출력
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [54]:
#row와 col의 일부만 기록할 수 있다. 
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c']) #b 컬럼의 3번째는 결측값인데, 나오지 않음

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [56]:
dates = pd.date_range('1/1/2022', periods=7) # 날짜도 가능
dates

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06', '2022-01-07'],
              dtype='datetime64[ns]', freq='D')

In [61]:
#Series에서도 to_csv 메소드가 존재한다.
import numpy as np

dates = pd.date_range('1/1/2022', periods=7) # freq = 'M' : 달이 바뀜, y는 년도가 바뀜
ts = pd.Series(np.arange(7), index=dates)
ts.to_csv('examples/tseries.csv')

In [62]:
!type examples\tseries.csv

,0
2022-01-01,0
2022-01-02,1
2022-01-03,2
2022-01-04,3
2022-01-05,4
2022-01-06,5
2022-01-07,6

### 구분자 형식 다루기 
#### read_table 함수가 실패하게끔 만드는 잘못된 표현이 파일에 존재할 수있다.

In [65]:
#ex7.csv파일은 이중 따옴표가 포함되어 있다.
!type examples\ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [66]:
#구분자가 한 글자인 경우 내장 csv모듈을 이용한다. csv.reader 함수에 넘겨 처리한다.
import csv

f = open('examples/ex7.csv')
reader = csv.reader(f)

In [70]:
#reader를 순회하며 둘러싸고 있던 큰 따옴표가 제거된 튜플을 얻을 수 있다.
for line in reader:
    print(line)

In [71]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [72]:
lines

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [73]:
header, values = lines[0], lines[1:]  #헤더와 데이터 구분

In [74]:
data_dict = {h: v for h,v in zip(header,zip(*values))} #사전표기법과 row를 컬럼으로 전치해주는 zip(*value)이용해서 컬럼사전 완성
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

#### CSV files come in different flavours.
#### To define a new format with different delimiter, quotation convention, or line terminator, just define a simple subclass of 'csv.Dialect'.
#### we can also give individual CSV dialect parameters as keywords to csv.reader.

In [79]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL
    
# lineterminator = '\n': 개행 문자(\n)를 행 구분자로 사용합니다.
# delimiter = ';': 구분자(delimiter)로 세미콜론(;)을 사용합니다.
# quotechar = '"': 인용 부호(quotechar)로 큰따옴표(")를 사용합니다.
# quoting = csv.QUOTE_MINIMAL: 인용 부호로 둘러싸인 필드 내에서 구분자를 처리하기 위해, 
                                        
# 필드의 내용이 인용 부호로 둘러싸여 있을 때 해당 인용 부호를 삭제하지 않고 유지합니다. 
# 따옴표(')나 쉼표(,) 등의 문자가 포함된 필드 내에서는 해당 필드를 큰따옴표로 감싸야 합니다.

In [80]:
f = open('examples/ex7.csv')
reader = csv.reader(f, dialect=my_dialect)

for line in reader:
    print(line)

['a,"b","c"']
['1,"2","3"']
['1,"2","3"']

In [87]:
f = open('examples/ex7.csv')
reader = csv.reader(f, delimiter='|')
for line in reader:
    print(line)

['a,"b","c"']
['1,"2","3"']
['1,"2","3"']

#### csv처럼 구분자로 구분된 파일을 기록하려면 csv.writer 옵션을 사용한다.  
#### csv.writer는 이미 열린, 쓰기가 가능한 파일 객체를 받아서 csv.reader와 동일한 옵션으로 파일을 기록한다.

In [88]:
with open('examples/mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))

In [89]:
!type examples\mydata.csv

one;two;three
1;2;3
4;5;6
7;8;9

### JSON Data
#### JSON (JavaScript Object Notation)은 웹브라우저와 다른 애플리케이션이 HTTP 요청으로 데이터를 보낼때 널리 사용하는 표준파일형식중 하나이다. JSON은 CSV보다 좀 더 유연한 데이터 형식이다.    
#### The basic types in JSON are:
####     1. Objects (dicts)
####     2. Arrays (lists)
####     3. Strings
####     4. Numbers
####     5. Booleans
####     6. Nulls
#### All the keys in the object must be strings.

In [8]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [9]:
import json

result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [10]:
asjson = json.dumps(result)
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [11]:
siblings = pd.DataFrame(result['siblings'], columns=['name','age']) # siblings에서, name과 age 출력
siblings

    name  age
0  Scott   30
1  Katie   38

#### 'pandas.read_json' can automatically convert JSON datasets into Series or DataFrame.
#### The default options for this assume that each object in the JSON array is a row in the table.
#### To export data from pandas to JSON, we can use 'to_json' method on a Series or DataFrame.

In [96]:
!type examples\example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [12]:
data = pd.read_json('examples/example.json') # pd json read
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [13]:
print(data.to_json()) # a열 1,4,7 b열 2,5,8 c열 3,6,9

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [110]:
print(data.to_json(orient='split'))
print(data.to_json(orient='records'))
print(data.to_json(orient='index'))
print(data.to_json(orient='columns'))
print(data.to_json(orient='values'))


# split : 행 인덱스를 기준으로 JSON 객체를 생성합니다.
# records : 각 행(row)을 JSON 객체로 변환합니다.
# index : 열 인덱스를 기준으로 JSON 객체를 생성합니다.
# columns : 각 열(column)을 JSON 객체로 변환합니다.
# values : 데이터 값들만 JSON 객체로 변환합니다.

{"columns":["a","b","c"],"index":[0,1,2],"data":[[1,2,3],[4,5,6],[7,8,9]]}
[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]
{"0":{"a":1,"b":2,"c":3},"1":{"a":4,"b":5,"c":6},"2":{"a":7,"b":8,"c":9}}
{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}
[[1,2,3],[4,5,6],[7,8,9]]

### XML and HTML : Web Scraping
#### 파이썬에는 lxml, Beautiful Soup, 그리고 html5lib와 같은 HTML과 XML 형식의 데이터를 읽고 쓸수있는 라이브러리가 많다. 그중에도 lxml은 가장 빠르게 동작하고 깨진 HTML과 XML 파일도 잘 처리해준다.

In [14]:
#read_html 사용
#미연방예금보험공사에서 부도은행을 보여주는 HTML을 다운로드.
import pandas as pd

tables = pd.read_html('examples/fdic_failed_bank_list.html')
len(tables)

1

In [15]:
tables

[                             Bank Name             City  ST   CERT  \
 0                          Allied Bank         Mulberry  AR     91
 1         The Woodbury Banking Company         Woodbury  GA  11297
 2               First CornerStone Bank  King of Prussia  PA  35312
 3                   Trust Company Bank          Memphis  TN   9956
 4           North Milwaukee State Bank        Milwaukee  WI  20364
 ..                                 ...              ...  ..    ...
 542                 Superior Bank, FSB         Hinsdale  IL  32646
 543                Malta National Bank            Malta  OH   6629
 544    First Alliance Bank & Trust Co.       Manchester  NH  34264
 545  National State Bank of Metropolis       Metropolis  IL   3815
 546                   Bank of Honolulu         Honolulu  HI  21029

                    Acquiring Institution        Closing Date  \
 0                           Today's Bank  September 23, 2016
 1                            United Bank     August 19, 2016
 2    First-Citizens Bank & Trust Company         May 6, 2016
 3             The Bank of Fayette County      April 29, 2016
 4    First-Citizens Bank & Trust Company      March 11, 2016
 ..                                   ...                 ...
 542                Superior Federal, FSB       July 27, 2001
 543                    North Valley Bank         May 3, 2001
 544  Southern New Hampshire Bank & Trust    February 2, 2001
 545              Banterra Bank of Marion   December 14, 2000
 546                   Bank of the Orient    October 13, 2000

           Updated Date
 0    November 17, 2016
 1    November 17, 2016
 2    September 6, 2016
 3    September 6, 2016
 4        June 16, 2016
 ..                 ...
 542    August 19, 2014
 543  November 18, 2002
 544  February 18, 2003
 545     March 17, 2005
 546     March 17, 2005

 [547 rows x 7 columns]]

In [116]:
failures = tables[0] 
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [122]:
close_timestamps = pd.to_datetime(failures['Closing Date'])
close_timestamps.dt.year.value_counts() #각년도를 카운트해서 가장 많은 순서대로 나열

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

### Parsing XML with lxml.Objectify
#### XML (eXtensible Markup Language)은 계층적 구조와 메타데이터를 포함하는 중첩된 데이터구조를 지원너하는 데이터 형식이다. 
#### XML과 HTML은 구조적으로 유사하지만, XML이 좀 더 범용적이다. 
#### lxml을 이용하여 XML 형식에서 데이터를 파싱하는 방법을 살펴본다. 
#### 뉴욕 MTA(Metropolitan Transportation Authority)는 버스와 전철 운영에 대한 데이터를 제공한다.

In [123]:
!type datasets\mta_perf\Performance_MNR.xml # 파일이 어디있죠~~

지정된 경로를 찾을 수 없습니다.

#### lxml.objectify를 이용해 파일을 파싱한 후, getroot 함수를 이용해 XML파일의 루트노드에 대한 참조를 얻어온다.  
#### 'root.INDICATOR'를 이용해 모든 INDICATOR XML element를 끄집어 낼 수있다. 각각의 항목에 대해 몇몇 태그는 제외하고 태크이름(YTD_ACTUAL같은)을 키값으로 하는 사전을 만들어 낼 수있다.

In [124]:
from lxml import objectify

path = 'datasets/mta_perf/Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot()

FileNotFoundError: [Errno 2] No such file or directory: 'datasets/mta_perf/Performance_MNR.xml'

In [90]:
data = []

skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ', 
               'DESIRED_CHANGE', 'DECIMAL_PLACES']

for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [91]:
perf = pd.DataFrame(data) # 이 사전 리스트를 DataFrame으로 변환

perf.head()

,AGENCY_NAME,CATEGORY,DESCRIPTION,FREQUENCY,INDICATOR_NAME,INDICATOR_UNIT,MONTHLY_ACTUAL,MONTHLY_TARGET,PERIOD_MONTH,PERIOD_YEAR,YTD_ACTUAL,YTD_TARGET
0,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,96.9,95,1,2008,96.9,95
1,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,95,95,2,2008,96,95
2,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,96.9,95,3,2008,96.3,95
3,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,98.3,95,4,2008,96.8,95
4,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,95.8,95,5,2008,96.6,95

#### XML 데이터를 얻으려면, 훨씬 더 복잡한 과정을 거쳐야 한다. 각각의 태그 또한 메타데이터를 가지고 있을 수 있다.
#### 유효한 XML 형식인 HTML의 'a' 태그를 생각하면 된다.

In [93]:
from io import StringIO

tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [94]:
root

In [88]:
root.get('href')  #이제 태그나 링크 이름에서 어떤필드(href 같은)라도 접근이 가능하다.

'http://www.google.com'

In [89]:
root.text

'Google'

## Binary Data Formats
#### 데이터를 효율적으로 저장하는 쉬운 방법은 파이썬에 내장되어 있는 'pickle 직렬화'를 사용해 데이터를 이진 형식으로 저장하는것이다.
#### pandas 객체는 모두 pickle을 이용해 데이터를 저장하는 to_pickle 메서드를 가지고 있다.

In [125]:
frame = pd.read_csv('examples/ex1.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [126]:
frame.to_pickle('examples/frame_pickle')

In [127]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

### HDF5 Format 사용하기
#### HDF5는 대량의 과학 계산용 배열 데이터를 저장하기 위해 고안된 파일 포맷이다. 
#### HDF는 (Hierarchical Data Format)의 약자이다. 
#### 여러개의 데이터셑을 저장하고 부가정보를 기록할 수 있다. 압축을 지원하며, 효과적으로 저장 가능하다.

#### pandas는 Series나 DataFrame 객체로 간단히 저장할 수 있는 고수준의 API를 제공한다.
#### HDFStore 클래스는 사전처럼 동작하며 세밀한 요구사항도 잘 처리해 준다.

In [134]:
!pip install tables

Requirement already satisfied: tables in c:\users\parkseungheun\appdata\local\programs\python\python311\lib\site-packages (3.8.0)
Requirement already satisfied: cython>=0.29.21 in c:\users\parkseungheun\appdata\local\programs\python\python311\lib\site-packages (from tables) (0.29.34)
Requirement already satisfied: numpy>=1.19.0 in c:\users\parkseungheun\appdata\local\programs\python\python311\lib\site-packages (from tables) (1.24.2)
Requirement already satisfied: numexpr>=2.6.2 in c:\users\parkseungheun\appdata\local\programs\python\python311\lib\site-packages (from tables) (2.8.4)
Requirement already satisfied: blosc2~=2.0.0 in c:\users\parkseungheun\appdata\local\programs\python\python311\lib\site-packages (from tables) (2.0.0)
Requirement already satisfied: packaging in c:\users\parkseungheun\appdata\local\programs\python\python311\lib\site-packages (from tables) (23.0)
Requirement already satisfied: py-cpuinfo in c:\users\parkseungheun\appdata\local\programs\python\python311\lib\site-packages (from tables) (9.0.0)
Requirement already satisfied: msgpack in c:\users\parkseungheun\appdata\local\programs\python\python311\lib\site-packages (from blosc2~=2.0.0->tables) (1.0.5)

[notice] A new release of pip available: 22.3.1 -> 23.1
[notice] To update, run: python.exe -m pip install --upgrade pip

Requirement already satisfied: pip in c:\users\parkseungheun\appdata\local\programs\python\python311\lib\site-packages (22.3.1)
Collecting pip
  Using cached pip-23.1-py3-none-any.whl (2.1 MB)
Installing collected packages: pip
  Attempting uninstall: pip
    Found existing installation: pip 22.3.1
    Uninstalling pip-22.3.1:
      Successfully uninstalled pip-22.3.1
Successfully installed pip-23.1

In [24]:
import numpy as np
import pandas as pd

frame = pd.DataFrame({'a': np.random.randn(100)})
store = pd.HDFStore('examples/mydata.h5')
store['obj1'] = frame
store['obj1_col'] = frame['a'] # 데이터 저장 잘됨

In [25]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: examples/mydata.h5

In [26]:
store['obj1'].head()

          a
0 -0.053135
1  1.473420
2 -0.296300
3 -0.403361
4  0.898606

#### HDFStore supports 2 storage schemas - 'fixed' and 'table'. table is generally slower but supports query operations using special syntax.
#### The 'put' is an explicit version of "store['obj2'] = frame" method but allows other options in the storage format.
#### The 'pandas.read_hdf' function gives you shortcut to these tools.

In [27]:
store.put('obj2', frame, format='table')
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10 -0.706554
11  0.034114
12 -1.398424
13  0.864329
14  0.688123
15  1.051843

In [28]:
store.close()

In [29]:
frame.to_hdf('mydata.h5', 'obj3', format='table')
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0 -0.053135
1  1.473420
2 -0.296300
3 -0.403361
4  0.898606

#### NOTE - For storage in remote servers like Amazon S3 or HDFS, use a different format suitable for distributed storage like Apache Parquet.
#### Caution - HDF5 is not a database. It is suited for 'write once, read many' datasets. Although data can be added to a file anytime, but if multiple writers do it simultaneously, the file becomes corrupted.

### Microsoft Excel Files 읽어오기
#### pandas는 'ExcelFile' class or 'pandas.read_excel' 함수를 이용해 Excel 2003 이후 버젼의 데이터를 읽어올 수있다.
#### 'xlrd'와 'openpyxl' 라이브러리를 설치해야 한다.

In [142]:
!pip install xlrd

Collecting xlrd
  Downloading xlrd-2.0.1-py2.py3-none-any.whl (96 kB)
                                              0.0/96.5 kB ? eta -:--:--
     ---------------------------------------- 96.5/96.5 kB 2.8 MB/s eta 0:00:00
Installing collected packages: xlrd
Successfully installed xlrd-2.0.1

In [143]:
!pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.2-py2.py3-none-any.whl (249 kB)
                                              0.0/250.0 kB ? eta -:--:--
     -------------------------------------  245.8/250.0 kB 5.0 MB/s eta 0:00:01
     -------------------------------------- 250.0/250.0 kB 3.9 MB/s eta 0:00:00
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.2

#### To use ExcelFile, create an instance by passing a path to an xls or xlsx file.
#### Data stored in a sheet can be read into a DataFrame with 'parse'.

In [144]:
import pandas as pd

xlsx = pd.ExcelFile('examples/ex1.xlsx') #xlsx 파일의 경로를 지정하여 객체생성

In [145]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

#### To read multiple sheets in a file, it is faster to create the ExcelFile, but we can simply pass the filename to 'pandas.read_excel'.
#### To write to Excel format, first create ExcelWriter, then write data to it using pandas 'to_write' method.
#### To avoid ExcelWriter, pass a file path to to_excel.

In [146]:
frame = pd.read_excel('examples/ex1.xlsx', 'Sheet1')
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [147]:
writer = pd.ExcelWriter('examples/ex2.xlsx')
frame.to_excel(writer, 'Sheet1')
writer.save()

C:\Users\PARKSEUNGHEUN\AppData\Local\Temp\ipykernel_14904\2157827127.py:3: FutureWarning: save is not part of the public API, usage can give unexpected results and will be removed in a future version
  writer.save()

In [148]:
frame2 = pd.read_excel('examples/ex2.xlsx', 'Sheet1')
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [22]:
frame.to_excel('examples/ex2.xlsx') #EXcelWriter를 사용하지 않고 to_excel 메서드에 파일 경로만 넘겨도 된다.

C:\Anaconda3\lib\site-packages\pandas\compat\_optional.py:106: UserWarning: Pandas requires version '0.9.8' or newer of 'xlsxwriter' (version '0.9.6' currently installed).
  warnings.warn(msg, UserWarning)

### Interacting with Web APIs
#### Many websites have public APIs that provide data feeds via JSON or some other format.
#### There are a number of ways to get their data, one of which is the 'requests' package.
#### In this example, we will find last 30 Github issues for pandas. We will use 'GET HTTP' request using requests library.
#### The response object's JSON will provide a dictionary having JSON parsed into native Python objects.
#### Each element in 'data' is a dict containing all of the data found in the Github Issue page (except for comments).
#### From this we can pass data directly to a DataFrame and extract fields of interest.

In [21]:
import requests

url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
resp

In [23]:
data = resp.json()
data[0]['title']

'pd.to_timedelta not parsing iso-formatted strings'

In [25]:
issues = pd.DataFrame(data, columns=['number', 'title', 'labels', 'state'])
issues.head()

,number,title,labels,state
0,21877,pd.to_timedelta not parsing iso-formatted strings,[],open
1,21874,BUG: Align Series.str.zfill() with str.zfill(),"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
2,21873,TST: Parameterize more tests,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
3,21872,"[REF] Move comparison methods to EAMixins, sha...","[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
4,21871,API: Add DataFrame.droplevel,"[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open

#### With some more work, we can create our own high-level interfaces to common web APIs that return DataFrame objects for easy analysis.

## Interacting with Databases
#### SQL Based relational Databases are widely used  to store data. Eg - SQL Server, PostgreSQL, MySQL, etc.
#### Many alternative databases have also become quite popular.
#### The choice of DataBase is usually dependant on performance, data integrity and scalability nneds of the application.

#### Loading data from SQl to DataFrame is straightforward. pandas has some functions to simplify the process.
#### In this example, we will create a SQLite database using Python's built in sqlite3 driver.

In [31]:
import sqlite3

query = """
CREATE TABLE test1
(a VARCHAR(20), b VARCHAR(20),
c REAL, d INTEGER);
"""

con = sqlite3.connect('mydata.sqlite')
con.execute(query)
con.commit()

In [32]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]

stmt = "INSERT INTO test1 VALUES(?,?,?,?)"

con.executemany(stmt, data)

In [33]:
con.commit()

#### Most SQL Drivers (PyODBC, psycopg2, MySQLdb, pymssql, etc.) return a list of tuples when selecting data from table.
#### We can use these list of tuples for the DataFrame, but the column names are present in the cursor's 'description' attribute.

In [36]:
cursor = con.execute('select * from test1')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [37]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [38]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

#### This is a lot of data munging taht we don't want to repeat.
#### The 'SQLAlchemy' is a popular Python toolkit that abstracts away many common differences between SQL databases.
#### pandas has 'read_sql' function that enables us to read data easily from general SQLAlchemy connection.

In [40]:
import sqlalchemy as sqla

db = sqla.create_engine('sqlite:///mydata.sqlite')
pd.read_sql('select * from test1', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5